### Author: Kubam Ivo Mbi
### Date: 8/11/2020
### Purpose: Titanic Kaggle Competition

## Data set preprocessing

In [ ]:
Based on the

In [20]:
# Importing necessary libraries
import pandas as pd
import numpy as np
from sklearn import preprocessing

In [74]:
# Import train data set
train_data = pd.read_csv("train.csv")

In [75]:
# dropping columns
train_df = train_data.drop(columns=["PassengerId", "Name", "SibSp", "Parch", "Ticket", "Cabin"])
train_df.head()

   Survived  Pclass     Sex   Age     Fare Embarked
0         0       3    male  22.0   7.2500        S
1         1       1  female  38.0  71.2833        C
2         1       3  female  26.0   7.9250        S
3         1       1  female  35.0  53.1000        S
4         0       3    male  35.0   8.0500        S

In [76]:
# Encoding categorical variables
train_df1 = pd.get_dummies(train_df,columns=["Pclass","Sex","Embarked"])
train_df1.head()

,Survived,Age,Fare,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,22.0,7.2500,0,0,1,0,1,0,0,1
1,1,38.0,71.2833,1,0,0,1,0,1,0,0
2,1,26.0,7.9250,0,0,1,1,0,0,0,1
3,1,35.0,53.1000,1,0,0,1,0,0,0,1
4,0,35.0,8.0500,0,0,1,0,1,0,0,1

In [77]:
# Handling missing values in the age column
train_df1["Age"] = train_df1["Age"].fillna(29.7) # imputing the mean value of 29.7 for all missing ages

In [78]:
def missing_zero_values_table(df):
        zero_val = (df == 0.00).astype(int).sum(axis=0)
        mis_val = df.isnull().sum()
        mis_val_percent = 100 * df.isnull().sum() / len(df)
        mz_table = pd.concat([zero_val, mis_val, mis_val_percent], axis=1)
        mz_table = mz_table.rename(
        columns = {0 : 'Zero Values', 1 : 'Missing Values', 2 : '% of Total Values'})
        mz_table['Total Zero Missing Values'] = mz_table['Zero Values'] + mz_table['Missing Values']
        mz_table['% Total Zero Missing Values'] = 100 * mz_table['Total Zero Missing Values'] / len(df)
        mz_table['Data Type'] = df.dtypes
        mz_table = mz_table[
            mz_table.iloc[:,1] != 0].sort_values(
        '% of Total Values', ascending=False).round(1)
        print ("Your selected dataframe has " + str(df.shape[1]) + " columns and " + str(df.shape[0]) + " Rows.\n"      
            "There are " + str(mz_table.shape[0]) +
              " columns that have missing values.")
#         mz_table.to_excel('D:/sampledata/missing_and_zero_values.xlsx', freeze_panes=(1,0), index = False)
        return mz_table

missing_zero_values_table(train_df1)

Your selected dataframe has 11 columns and 891 Rows.
There are 0 columns that have missing values.

Empty DataFrame
Columns: [Zero Values, Missing Values, % of Total Values, Total Zero Missing Values, % Total Zero Missing Values, Data Type]
Index: []

In [79]:
# Normalising Age and Fare
x = train_df1[["Age","Fare"]].values
normaliser = preprocessing.Normalizer()
x_normalized = normaliser.fit_transform(x)
df = pd.DataFrame(x_normalized)

In [80]:
train_clean = pd.concat([train_df1, df], axis=1)

In [81]:
train_clean = train_clean.drop(columns=["Age","Fare"])

In [84]:
train_clean = train_clean.rename(columns={0:"Age",1:"Fare"})

In [85]:
train_clean.head()

,Survived,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Age,Fare
0,0,0,0,1,0,1,0,0,1,0.949757,0.312988
1,1,1,0,0,1,0,1,0,0,0.470417,0.882444
2,1,0,0,1,1,0,0,0,1,0.956551,0.291564
3,1,1,0,0,1,0,0,0,1,0.550338,0.834942
4,0,0,0,1,0,1,0,0,1,0.974555,0.224148

In [88]:
train_clean.to_csv("train_clean", index=False)